ninjasstudio/micropython/ports/esp32/machine_pwm.c
// Find a free PWM channel, also spot if our pin is already mentioned.
STATIC int find_channel(int mode, int pin) {
    PWM_DBG("find_channel(mode=%d pin=%d)", mode, pin)
    int avail_channel = -1;
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if (chans[mode][channel].pin == pin) {
            return channel;
        }
        if ((avail_channel < 0) && (chans[mode][channel].pin < 0)) {
            avail_channel = channel;
        }
    }
    return avail_channel;
}

STATIC int find_new_channel(machine_pwm_obj_t *self) {
    PWM_DBG("find_new_channel()")
    int channel = -1;
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        ////if (is_free_channel(mode)) {
            channel = find_channel(mode, self->pin);
            if (channel >= 0) {
                self->mode = mode;
                break;
            }
        ////}
    }
    if (channel < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("1 out of PWM channels:%d"), PWM_CHANNEL_MAX); // in all modes
    }
    return channel;
}

STATIC int find_free_timer(machine_pwm_obj_t *self, int check_mode) {
    PWM_DBG("find_free_timer(%d)", check_mode)
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        if ((check_mode < 0) || is_free_channel(check_mode)) {
            for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
                if ((check_mode < 0) || (check_mode == mode)) {
                    if (timers[mode][timer].freq_hz == 0) {
                        self->mode = mode;
                        return timer;
                    }
                }
            }
        }
    }
    return -1;
}

/*
STATIC int find_timer(int mode, unsigned int freq) {
    PWM_DBG("find_timer() mode=%d freq=%d", mode, freq)
    int timer_found = -1;
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if (chans[mode][channel].freq == freq) {
            timer_found = chans[mode][channel].timer;
            break;
        }
    }
    return timer_found;
}
*/

// Return timer with the same mode and frequency
STATIC int find_timer(int mode, unsigned int freq) {
    PWM_DBG("find_timer(mode=%d freq=%d)", mode, freq)
    for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
        if (timers[mode][timer].freq_hz == freq) {
            return timer;
        }
    }
    return -1;
}
/*
aaa
If the frequency is changed, try to find a timer with the same frequency
in the current mode, otherwise in the next mode.
If the mode is changed, release the channel and select a new channel in the next mode.
Then set the frequency with the same duty.
*/
STATIC void select_a_timer(machine_pwm_obj_t *self, unsigned int freq) {
    PWM_DBG("select_a_timer(freq=%d mode=%d)", freq, self->mode)
    if ((freq <= 0) || (freq > 40000000)) {
        mp_raise_ValueError(MP_ERROR_TEXT("frequency must be from 1Hz to 40MHz"));
    }
    int save_timer = self->timer;
    int save_channel = self->channel;
    int save_mode = self->mode;
    if (self->mode < 0) {
        self->mode = 0;
    }
    // Check if an already running timer with the required frequency is running in the same mode
    int new_timer = -1;
    //if (is_free_channel(self->mode)) {
        new_timer = find_timer(self->mode, freq);
    //}
    if (save_mode >= 0)
        if (!is_free_channel(self->mode, self->pin)) {
            // There is a timer, but there is no channel
            new_timer = -1;
        }
    }
    // If no existing timer and channel was found, then find a new one in another mode
    int new_mode = self->mode;
    if (new_timer < 0) {
        // Calc next mode
        if (new_mode > 0) {
            --new_mode;
        } else if (new_mode < (LEDC_SPEED_MODE_MAX - 1)) {
            ++new_mode;
        }
        if (self->mode != new_mode) {
            #define ANY_PIN (-1)
            if (is_free_channel(new_mode, ANY_PIN)) {
                new_timer = find_timer(new_mode, freq);
                self->mode = new_mode;
            }
        }
    }
    if (new_timer >= 0) {
        if (self->timer != new_timer) {
            unregister_old_channel(mode, channel);

            // Bind the channel to the new timer
            if (ledc_bind_channel_timer(self->mode, self->channel, new_timer) != ESP_OK) {
                mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("failed to bind mode %d timer %d to channel %d"), self->mode, self->channel, new_timer);
            }
            chans[self->mode][self->channel].timer = new_timer;
        }
    }
    if (new_timer < 0) {
        #define ANY_MODE (-1)
        new_timer = find_free_timer(self, ANY_MODE);
    }
    if (new_timer < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM timers:%d"), PWM_TIMER_MAX);
    }
    self->timer = new_timer;
}

#define get_duty_raw(self) ledc_get_duty(self->mode, self->channel)

STATIC uint32_t get_duty_u16(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    int resolution = timers[self->mode][self->timer].duty_resolution;
    int duty = ledc_get_duty(self->mode, self->channel);
    if (resolution <= UI_RES_16_BIT) {
        duty <<= (UI_RES_16_BIT - resolution);
    } else {
        duty >>= (resolution - UI_RES_16_BIT);
    }
    return duty;
}

STATIC uint32_t get_duty_u10(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    return get_duty_u16(self) >> 6; // Scale down from 16 bit to 10 bit resolution
}

STATIC uint32_t get_duty_ns(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    return duty_to_ns(self, get_duty_u16(self));
}

/******************************************************************************/
// MicroPython bindings for PWM

STATIC void mp_machine_pwm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_pwm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "PWM(Pin(%u)", self->pin);
    if (self->active) {
        mp_printf(print, ", freq=%u", ledc_get_freq(self->mode, self->timer));

        if (self->duty_x == PWM_RES_10_BIT) {
            mp_printf(print, ", duty=%d", get_duty_u10(self));
        } else if (self->duty_x == -HIGHEST_PWM_RES) {
            mp_printf(print, ", duty_ns=%d", get_duty_ns(self));
        } else {
            mp_printf(print, ", duty_u16=%d", get_duty_u16(self));
        }
        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0)
        if (self->output_invert) {
            mp_printf(print, ", invert=%d", self->output_invert);
        }
        #endif
        mp_printf(print, ")");
        int resolution = timers[self->mode][self->timer].duty_resolution;
        mp_printf(print, "  # resolution=%d", resolution);

        mp_printf(print, ", (duty=%.2f%%, resolution=%.3f%%)", 100.0 * get_duty_raw(self) / (1 << resolution), 100.0 * 1 / (1 << resolution)); // percents

        mp_printf(print, ", mode=%d, channel=%d, timer=%d", self->mode, self->channel, self->timer);
    } else {
        mp_printf(print, ")");
    }
}

